Revit 2024 API
PreviewControl.SetBinding Method
Overload List
Name | Description
SetBinding(DependencyProperty, BindingBase)
Attaches a binding to this element, based on the provided binding object.
 (Inherited from FrameworkElement.)
SetBinding(DependencyProperty, String)
Attaches a binding to this element, based on the provided source property name as a path qualification to the data source.
 (Inherited from FrameworkElement.)
See Also
PreviewControl Class
PreviewControl Members
Autodesk.Revit.UI Namespace